quickstarts/bpel-loan-approval/src/test/resources/xml/soap-loanreq1.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header>
    <ns:conversationId xmlns:ns="http://www.jboss.org/cid">12345</ns:conversationId>
    <ns:exampleHeader xmlns:ns="http://www.jboss.org/header">Inbound</ns:exampleHeader>
   </soapenv:Header>
   <soapenv:Body>
        <ns1:request xmlns:ns1="http://example.com/loan-approval/loanService/">
           <ns1:firstName>Fred</ns1:firstName>
           <ns1:name>Bloggs</ns1:name>
           <ns1:amount>100</ns1:amount>
        </ns1:request>
   </soapenv:Body>
</soapenv:Envelope>
